In exercise folder (same level as this notebook on github) there is hiring.csv. This file contains hiring statics for a firm such as experience of candidate, his written test score and personal interview score. Based on these 3 factors, HR will decide the salary. Given this data, you need to build a machine learning model for HR department that can help them decide salaries for future candidates. Using this predict salaries for following candidates,

2 yr experience, 9 test score, 6 interview score

12 yr experience, 10 test score, 10 interview score


Answer
53713.86 and 93747.79

In [1]:
import pandas as pd
import numpy as np
from sklearn import linear_model
from word2number import w2n

/home/ubox96/anaconda3/lib/python3.9/site-packages/scipy/__init__.py:146: UserWarning: A NumPy version >=1.16.5 and <1.23.0 is required for this version of SciPy (detected version 1.24.2
  warnings.warn(f"A NumPy version >={np_minversion} and <{np_maxversion}"

In [2]:
def dtype_change(col):
    df['col'] = df['col'].astype('str')
    for i in df['col']:
        df['col'] = w2n.word_to_num(i)

In [3]:
df = pd.read_csv(r"/home/ubox96/ML/Hiring/hiring.csv")
df.rename(columns = {'test_score(out of 10)':'Test_s','interview_score(out of 10)':'Interview_s', }, inplace = True)
df.rename(columns = {'interview_score(out of 10)':'Interview_s'}, inplace = True)
df.rename(columns = {'salary($)':'salary'}, inplace = True)
df.head()

  experience  Test_s  Interview_s  salary
0        NaN     8.0            9   50000
1        NaN     8.0            6   45000
2       five     6.0            7   60000
3        two    10.0           10   65000
4      seven     9.0            6   70000

In [4]:
df.isnull().sum()

experience     2
Test_s         1
Interview_s    0
salary         0
dtype: int64

In [5]:
df.Test_s = df.Test_s.fillna(df.Test_s.mean())
df.experience = df.experience.fillna("zero")

In [6]:
for i in range(len(df.experience)):
    df.experience[i] = w2n.word_to_num(df.experience[i])
df.head()

/tmp/ipykernel_67986/3385451505.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.experience[i] = w2n.word_to_num(df.experience[i])

  experience  Test_s  Interview_s  salary
0          0     8.0            9   50000
1          0     8.0            6   45000
2          5     6.0            7   60000
3          2    10.0           10   65000
4          7     9.0            6   70000

In [7]:
x = df.drop('salary',axis='columns')
y = df.salary

In [8]:
model = linear_model.LinearRegression()
model.fit(x,y)

LinearRegression()

In [9]:
pred = pd.DataFrame({"experience":[2,12],"Test_s":[9,10],"Interview_s":[6,10]})
pred

   experience  Test_s  Interview_s
0           2       9            6
1          12      10           10

In [10]:
result = model.predict(pred)
result

array([53290.89255945, 92268.07227784])

In [11]:
result = [round(i,2) for i in result]
pred['salary'] = result
result

[53290.89, 92268.07]

In [12]:
pred.to_csv(r"/home/ubox96/ML/Hiring/result.csv")